src/InformationRegisters/СчетаРеглУчетаТребующиеНастройки/СчетаРеглУчетаТребующиеНастройки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СчетаРеглУчетаТребующиеНастройки</name>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>АналитикаУчета</name>
    <type>
      <types>DefinedType.НастройкаСчетовУчетаАналитикаУчета</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МестоУчета</name>
    <type>
      <types>DefinedType.НастройкаСчетовУчетаМестоУчета</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидСчета</name>
    <type>
      <types>EnumRef.ВидыСчетовРеглУчета</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Долгосрочный</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/СчетаРеглУчетаТребующиеНастройки/RecordSetModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытийФормы

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
	ВидыСчетовЗаписываемыеВРегистрТребующихсяНастроек = РегистрыСведений.СчетаРеглУчетаТребующиеНастройки.НастраиваемыеВидыСчетов();
	МассивЗаписейДляУдаления = Новый Массив;
	КодОсновногоЯзыка = ОбщегоНазначения.КодОсновногоЯзыка();
	ШаблонСообщения = НСтр("ru = 'При записи счетов требующих настроек, ошибка: для вида счета ""%1""';
							|en = 'An error occurred when saving the accounts that need to be configured: for the ""%1"" account kind'", КодОсновногоЯзыка);
	ОбъектМетаданных = Метаданные.РегистрыСведений.СчетаРеглУчетаТребующиеНастройки;
	ОтражаемыйДокумент = Неопределено;
	ДополнительныеСвойства.Свойство("Документ", ОтражаемыйДокумент);
	
	Для каждого СтрокаРегистра Из ЭтотОбъект Цикл
		
		ЗаписьДобавлена = Ложь;
		
		Если ВидыСчетовЗаписываемыеВРегистрТребующихсяНастроек.Найти(СтрокаРегистра.ВидСчета) = Неопределено Тогда
			// Данный вид счета не настраивается в рабочем месте, поэтому его запись в данный регистр не имеет смысла.
			МассивЗаписейДляУдаления.Добавить(СтрокаРегистра);
			Продолжить;
		КонецЕсли;
		
		ОбязательныеИзмеренияРегистра = РегистрыСведений.СчетаРеглУчетаТребующиеНастройки.СписокИзмеренийРегистраПоВидуСчета(СтрокаРегистра.ВидСчета, Истина);
		ОбязательныеИзмеренияРегистра.Добавить("ВидСчета");
		
		Для каждого ИзмерениеРегистра Из ОбязательныеИзмеренияРегистра Цикл
			Если Не ЗначениеЗаполнено(СтрокаРегистра[ИзмерениеРегистра]) Тогда
				ТекстСообщения = ШаблонСообщения + " " + НСтр("ru = 'не заполнено измерение регистра ""%2"".';
																|en = 'the ""%2"" register dimension is not filled in.'", КодОсновногоЯзыка);
				ТекстСообщения = СтрШаблон(ТекстСообщения, СтрокаРегистра.ВидСчета, ИзмерениеРегистра);
				ЗаписьЖурналаРегистрации(НСтр("ru = 'Отражение в регламентированном учете';
												|en = 'Record in local accounting'", КодОсновногоЯзыка),
					УровеньЖурналаРегистрации.Ошибка, ОбъектМетаданных, ОтражаемыйДокумент, ТекстСообщения);
				МассивЗаписейДляУдаления.Добавить(СтрокаРегистра);
				ЗаписьДобавлена = Истина;
			КонецЕсли;
		КонецЦикла;
		
		РазделУчета = НастройкаСчетовУчетаКлиентСервер.РазделУчетаПоИмениСчета(XMLСтрока(СтрокаРегистра.ВидСчета));
		ОграничениеТипаМестоУчета = НастройкаСчетовУчетаСервер.НастройкиМестаУчетаПоРазделуУчета(РазделУчета).ТипЗначения;
		Если ОграничениеТипаМестоУчета <> Неопределено И Не ОграничениеТипаМестоУчета.СодержитТип(ТипЗнч(СтрокаРегистра.МестоУчета)) И Не РазделУчета = "Номенклатура" Тогда
			ТекстСообщения = ШаблонСообщения + " " + НСтр("ru = 'тип значения измерения ""Место учета"" (%2) не соответствует требуемому.';
															|en = 'value type of the ""Registration place""  dimension (%2) does not conform to the required one.'", КодОсновногоЯзыка);
			ТекстСообщения = СтрШаблон(ТекстСообщения, СтрокаРегистра.ВидСчета, ТипЗнч(СтрокаРегистра.МестоУчета));
			ЗаписьЖурналаРегистрации(НСтр("ru = 'Отражение в регламентированном учете';
											|en = 'Record in local accounting'", КодОсновногоЯзыка),
				УровеньЖурналаРегистрации.Ошибка, ОбъектМетаданных, ОтражаемыйДокумент, ТекстСообщения);
			Если Не ЗаписьДобавлена Тогда
				МассивЗаписейДляУдаления.Добавить(СтрокаРегистра);
				ЗаписьДобавлена = Истина;
			КонецЕсли;
		КонецЕсли;
		
		ОграничениеТипаАналитикаУчета = НастройкаСчетовУчетаСервер.НастройкиАналитикиУчетаПоРазделуУчета(РазделУчета).ТипЗначения;
		Если ОграничениеТипаАналитикаУчета <> Неопределено И Не ОграничениеТипаАналитикаУчета.СодержитТип(ТипЗнч(СтрокаРегистра.АналитикаУчета)) Тогда
			ТекстСообщения = ШаблонСообщения + " " + НСтр("ru = 'тип значения измерения ""Аналитика учета"" (%2) не соответствует требуемому.';
															|en = 'value type of the ""Accounting dimension"" dimension (%2) does not conform to the required one.'", КодОсновногоЯзыка);
			ТекстСообщения = СтрШаблон(ТекстСообщения, СтрокаРегистра.ВидСчета, ТипЗнч(СтрокаРегистра.АналитикаУчета));
			ЗаписьЖурналаРегистрации(НСтр("ru = 'Отражение в регламентированном учете';
											|en = 'Record in local accounting'", КодОсновногоЯзыка),
				УровеньЖурналаРегистрации.Ошибка, ОбъектМетаданных, ОтражаемыйДокумент, ТекстСообщения);
			Если Не ЗаписьДобавлена Тогда
				МассивЗаписейДляУдаления.Добавить(СтрокаРегистра);
				ЗаписьДобавлена = Истина;
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	Если МассивЗаписейДляУдаления.Количество() Тогда
		Для каждого ЗаписьДляУдаления Из МассивЗаписейДляУдаления Цикл
			ЭтотОбъект.Удалить(ЗаписьДляУдаления);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
